report.example/oltp_write_only_16threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 16 tps: 17384.23 qps: 104382.28 (r/w/o: 0.00/69597.84/34784.44) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 16 tps: 17310.83 qps: 103821.98 (r/w/o: 0.00/69204.32/34617.66) lat (ms,95%): 1.55 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 16 tps: 17209.94 qps: 103267.65 (r/w/o: 0.00/68844.77/34422.88) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 16 tps: 17213.96 qps: 103292.74 (r/w/o: 0.00/68863.83/34428.91) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 16 tps: 17424.22 qps: 104547.31 (r/w/o: 0.00/69699.87/34847.44) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 16 tps: 17354.02 qps: 104124.11 (r/w/o: 0.00/69416.07/34708.04) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 16 tps: 17389.01 qps: 104321.08 (r/w/o: 0.00/69542.05/34779.03) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 16 tps: 17330.91 qps: 104001.44 (r/w/o: 0.00/69341.63/34659.81) lat (ms,95%): 1.50 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 16 tps: 17389.02 qps: 104332.15 (r/w/o: 0.00/69552.10/34780.05) lat (ms,95%): 1.50 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 16 tps: 17566.94 qps: 105381.66 (r/w/o: 0.00/70250.77/35130.89) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 16 tps: 17501.10 qps: 105052.62 (r/w/o: 0.00/70047.42/35005.21) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 16 tps: 17556.95 qps: 105301.68 (r/w/o: 0.00/70187.79/35113.89) lat (ms,95%): 1.50 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 16 tps: 17310.79 qps: 103864.72 (r/w/o: 0.00/69245.14/34619.57) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 16 tps: 17212.13 qps: 103288.79 (r/w/o: 0.00/68861.53/34427.26) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 16 tps: 17236.01 qps: 103399.07 (r/w/o: 0.00/68930.05/34469.02) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 16 tps: 17564.98 qps: 105412.89 (r/w/o: 0.00/70282.93/35129.96) lat (ms,95%): 1.50 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 16 tps: 17201.12 qps: 103212.72 (r/w/o: 0.00/68808.48/34404.24) lat (ms,95%): 1.55 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 16 tps: 17435.95 qps: 104622.67 (r/w/o: 0.00/69750.78/34871.89) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 16 tps: 17272.06 qps: 103618.34 (r/w/o: 0.00/69074.23/34544.11) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 17280.80 qps: 103666.80 (r/w/o: 0.00/69106.20/34560.60) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 16 tps: 17530.26 qps: 105203.59 (r/w/o: 0.00/70142.06/35061.53) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 16 tps: 17505.90 qps: 105045.39 (r/w/o: 0.00/70033.59/35011.80) lat (ms,95%): 1.50 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 16 tps: 17275.48 qps: 103616.90 (r/w/o: 0.00/69066.93/34549.97) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 16 tps: 17435.48 qps: 104625.87 (r/w/o: 0.00/69753.91/34871.96) lat (ms,95%): 1.50 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 16 tps: 17450.14 qps: 104697.86 (r/w/o: 0.00/69798.57/34899.29) lat (ms,95%): 1.50 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 16 tps: 17422.01 qps: 104516.05 (r/w/o: 0.00/69672.03/34844.02) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 16 tps: 17539.98 qps: 105247.87 (r/w/o: 0.00/70169.91/35077.96) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 16 tps: 17494.99 qps: 104983.95 (r/w/o: 0.00/69991.97/34991.98) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 16 tps: 17291.01 qps: 103742.05 (r/w/o: 0.00/69160.03/34582.02) lat (ms,95%): 1.55 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 17444.34 qps: 104652.04 (r/w/o: 0.00/69766.36/34885.68) lat (ms,95%): 1.55 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           2086288
        other:                           1043144
        total:                           3129432
    transactions:                        521572 (17383.73 per sec.)
    queries:                             3129432 (104302.36 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0024s
    total number of events:              521572

Latency (ms):
         min:                                    0.28
         avg:                                    0.92
         max:                                   24.61
         95th percentile:                        1.52
         sum:                               479794.50

Threads fairness:
    events (avg/stddev):           32598.2500/2076.73
    execution time (avg/stddev):   29.9872/0.00